Autodesk.Revit.DB.Structure.RebarContainerParameterManager.AddSharedParameterAsOverride(Autodesk.Revit.DB.ElementId)
Adds a shared parameter as one of the parameter overrides stored by this Rebar Container element.
paramId:
The id of the shared parameter element
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
-or-
paramId is not the id of a shared parameter in the current document,
or its name was already used by another shared parameter of the element.
-or-
paramId is already a Rebar Container parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.IsRebarContainerParameter(Autodesk.Revit.DB.ElementId)
Checks if the parameter is a Rebar Container parameter
paramId:
The id of the parameter element
Returns:
True if the parameter is  a Rebar Container parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.IsParameterOverridden(Autodesk.Revit.DB.ElementId)
Checks if the parameter has an override
paramId:
The id of the parameter element
Returns:
True if the parameter has an override
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.IsOverriddenParameterModifiable(Autodesk.Revit.DB.ElementId)
Checks if overridden parameter is modifiable.
paramId:
Overridden parameter id
Returns:
True if the parameter is modifiable, false if the parameter is readonly.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId has no override
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.SetOverriddenParameterModifiable(Autodesk.Revit.DB.ElementId)
Sets this overridden parameter to be modifiable.
paramId:
Overridden parameter id
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId has no override
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.SetOverriddenParameterReadonly(Autodesk.Revit.DB.ElementId)
Sets this overridden parameter to be readonly.
paramId:
Overridden parameter id
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId has no override
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.ClearOverrides
Clears any overridden values from all parameters of the associated RebarContainer element.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.RemoveOverride(Autodesk.Revit.DB.ElementId)
Removes an overridden value from the given parameter.
paramId:
The id of the parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId has no override
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.GetElementIdOverrideValue(Autodesk.Revit.DB.ElementId)
Get the ElementId value for an overriden parameter.
paramId:
The id of the parameter
Returns:
The override value of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a parameter in the current document,
or its value type is not ElementId.
-or-
paramId is not a Rebar Container parameter
-or-
paramId has no override
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.GetStringOverrideValue(Autodesk.Revit.DB.ElementId)
Get the string value for an overriden parameter.
paramId:
The id of the parameter
Returns:
The override value of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a parameter in the current document,
or its value type is not sring.
-or-
paramId is not a Rebar Container parameter
-or-
paramId has no override
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.GetIntOverrideValue(Autodesk.Revit.DB.ElementId)
Get the integer value for an overriden parameter.
paramId:
The id of the parameter
Returns:
The override value of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a parameter in the current document,
or its value type is not integer.
-or-
paramId is not a Rebar Container parameter
-or-
paramId has no override
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.GetDoubleOverrideValue(Autodesk.Revit.DB.ElementId)
Get the double value for an overriden parameter.
paramId:
The id of the parameter
Returns:
The override value of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a parameter in the current document,
or its value type is not double.
-or-
paramId is not a Rebar Container parameter
-or-
paramId has no override
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.AddOverride(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
paramId:
The id of the parameter
value:
The override value of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a parameter in the current document,
or its value type is not ElementId.
-or-
paramId is not a Rebar Container parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.AddOverride(Autodesk.Revit.DB.ElementId,System.String)
Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
paramId:
The id of the parameter
value:
The override value of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a parameter in the current document,
or its value type is not sring.
-or-
paramId is not a Rebar Container parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.AddOverride(Autodesk.Revit.DB.ElementId,System.Int32)
Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
paramId:
The id of the parameter
value:
The override value of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a parameter in the current document,
or its value type is not integer.
-or-
paramId is not a Rebar Container parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerParameterManager.AddOverride(Autodesk.Revit.DB.ElementId,System.Double)
Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
paramId:
The id of the parameter
value:
The override value of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a parameter in the current document,
or its value type is not double.
-or-
paramId is not a Rebar Container parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016